# PlumbingFixturesSupplyFitting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PlumbingFixturesSupplyFitting Property
ParameterTypeId Class See Also
---
"Supply Fitting"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PlumbingFixturesSupplyFitting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlumbingFixturesSupplyFitting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PlumbingFixturesSupplyFitting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace